# In this notebook, some codes for useful and commonly used methods in Python are provided.

# String format() method

In [1]:
name = "John"
age = 36

In [2]:
txt1 = "My name is {fname}, I'm {age}".format(fname = name, age = age)
print(txt1)

My name is John, I'm 36

In [3]:
txt2 = "My name is {0}, I'm {1}".format(name,age)
print(txt2)

My name is John, I'm 36

In [4]:
txt3 = "My name is {}, I'm {}".format(name,age)
print(txt3)

My name is John, I'm 36

# F-strings method

In [5]:
name = "Eric"
age = 74
print(f"Hello, {name}. You are {age}.")

Hello, Eric. You are 74.

# Asking for user input

In [6]:
name = ''

while name == '':
    name = input("Please enter your name: ")
    
print(f"Hello {name}!")

Please enter your name: Michael
Hello Michael!

# Tuple packing and unpacking
When we create a tuple, we normally assign values to it. This is called "packing" a tuple. But, in Python, we are also allowed to extract the values back into variables. This is called "unpacking".

In [7]:
# Packing a tuple
fruits = ("apple", "banana", "cherry")
fruits

('apple', 'banana', 'cherry')

In [8]:
# Unpacking a tuple
fruits = ("apple", "banana", "cherry")

(green, yellow, red) = fruits

print(green)
print(yellow)
print(red)

apple
banana
cherry

# append()
Adding element to an existing list.

In [9]:
fruits = ['apple', 'banana', 'cherry']
fruits.append("orange")

In [10]:
print(fruits)

['apple', 'banana', 'cherry', 'orange']

# pop()
Remove the last element from an existing list (which element to be removed can be specified).

In [11]:
my_list = [1,2,3,4,5]
my_list

[1, 2, 3, 4, 5]

In [12]:
my_list.pop()

5

In [13]:
my_list

[1, 2, 3, 4]

# sort()
Sort the list alphabetically.

In [14]:
cars = ['Ford', 'BMW', 'Volvo']
cars.sort()

In [15]:
print(cars)

['BMW', 'Ford', 'Volvo']

# reverse()
Reverse the sorting order of the elements.

In [16]:
cars = ['Ford', 'BMW', 'Volvo']
cars.reverse()

In [17]:
print(cars)

['Volvo', 'BMW', 'Ford']

# join()
Take all items in an iterable and joins them into one string. A string must be specified as the separator.

In [18]:
my_list = ['a','b','c']
x = ' '.join(my_list)
print(x)

a b c

In [19]:
myTuple = ("John", "Peter", "Vicky")
y = "#".join(myTuple)
print(y)

John#Peter#Vicky

# range()
Returns a sequence of numbers, starting from 0 by default, and increments by 1 (by default), and stops before a specified number.

In [20]:
x = range(6)

for n in x:
      print(n)

0
1
2
3
4
5

In [21]:
x = range(3, 20, 2)

for n in x:
    print(n)

3
5
7
9
11
13
15
17
19

# enumerate()
The enumerate() function takes a collection (e.g. a tuple) and returns it as an enumerate object.
The enumerate() function adds a counter as the key of the enumerate object.

In [22]:
x = ('apple', 'banana', 'cherry')
y = enumerate(x,start = 0)

In [23]:
print(y)

<enumerate object at 0x000001D8F9E96200>

In [24]:
for item in y:
    print(item)

(0, 'apple')
(1, 'banana')
(2, 'cherry')

# zip()
The zip() function returns a zip object, which is an iterator of tuples where the first item in each passed iterator is paired together, and then the second item in each passed iterator are paired together etc.
If the passed iterators have different lengths, the iterator with the least items decides the length of the new iterator.

In [25]:
mylist1 = [1,2,3]
mylist2 = ['a','b','c']
mylist3 = [100,200,300]

In [26]:
my_zip = zip(mylist1,mylist2,mylist3)

In [27]:
my_zip

In [28]:
for item in my_zip:
    print(item)

(1, 'a', 100)
(2, 'b', 200)
(3, 'c', 300)

# in keyword
The in keyword is used to check if a value is present in a sequence (list, range, string etc.).
The in keyword can also used to iterate through a sequence in a for loop.

In [29]:
'x' in [1,2,3]

False

In [30]:
'x' in ['x','y','z']

True

In [31]:
fruits = ["apple", "banana", "cherry"]

if "banana" in fruits:
    print("yes")

yes

# min()
Return the item with the lowest value, or the item with the lowest value in an iterable.
If the values are strings, an alphabetically comparison is done.

In [32]:
my_num_list = [10, 20, 30, 40, 50]
my_char_list = ['a','b','c','d','e']

In [33]:
min(my_num_list)

10

In [34]:
min(my_char_list)

'a'

# max()
Return the item with the highest value, or the item with the highest value in an iterable. If the values are strings, an alphabetically comparison is done.

In [35]:
my_num_list = [10, 20, 30, 40, 50]
my_char_list = ['a','b','c','d','e']

In [36]:
max(my_num_list)

50

In [37]:
max(my_char_list)

'e'

# Tips for quickly creating a list from a string using split()

In [38]:
my_quick_list = 'a b c d e f g h i j k l m n'.split()
my_quick_list

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n']

In [39]:
'a b c d e'.split()

['a', 'b', 'c', 'd', 'e']

In [40]:
'a,b,c,d,e'.split(',')

['a', 'b', 'c', 'd', 'e']

In [41]:
'a#b#c#d#e#f#g'.split('#')

['a', 'b', 'c', 'd', 'e', 'f', 'g']

# List Comprehension
- Unique way of quickly creating a list in Python
- Offer a shorter syntax when you want to create a new list based on the values of an existing list

Some general syntax:

expression for item in iterable

expression for item in iterable if condition

expression1 if condition else expression2 for item in iterable

In [42]:
mystring = 'hello'

In [43]:
# Retrieve a list which contains all the characters from mystring using list comprehension
mylist = [char for char in mystring]
mylist

['h', 'e', 'l', 'l', 'o']

In [44]:
my_num_list = list(range(1,21))
my_num_list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [45]:
# Retrieve a list which contains all the even numbers from my_num_list using list comprehension
my_num_list_even = [num for num in my_num_list if num%2 == 0]
my_num_list_even

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [46]:
# Retrieve a list which is 2 times the value of my_num_list using list comprehension
my_num_list_2times = [2 * num for num in my_num_list]
my_num_list_2times

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]

In [47]:
# Retrieve a list which shows values only for even numbers. For odd numbers the list will show them as 'NOT EVEN'
my_num_list_even_noteven = [num if num%2 == 0 else 'NOT EVEN' for num in my_num_list]
my_num_list_even_noteven

['NOT EVEN',
 2,
 'NOT EVEN',
 4,
 'NOT EVEN',
 6,
 'NOT EVEN',
 8,
 'NOT EVEN',
 10,
 'NOT EVEN',
 12,
 'NOT EVEN',
 14,
 'NOT EVEN',
 16,
 'NOT EVEN',
 18,
 'NOT EVEN',
 20]

In [48]:
# Convert a list of temperatures in celsius into fahrenheit using list comprehension
temp_celsius = [0,10,20,34.5]

temp_fahrenheit = [((9/5)*temp + 32) for temp in temp_celsius]
temp_fahrenheit

[32.0, 50.0, 68.0, 94.1]

# Lambda Expression
A lambda function is a small anonymous function.

A lambda function can take any number of arguments, but can only have one expression.

Lambda expression is useful when combined with apply() method from pandas for dataframe manipulation.

In [49]:
x = lambda a : a + 10
print(x(5))

15

In [50]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [51]:
x = lambda a, b, c : a + b + c
print(x(5, 6, 2))

13

In [52]:
# Import numpy and pandas libraries
import numpy as np
import pandas as pd

In [53]:
# Create a dataframe
df_employee = pd.DataFrame({'ID':[1,2,3,4,5],
                            'Name': ['Tom','John','David','Eve','Anna'],
                            'Sex': ['Male','Male','Male','Female','Female'],
                            'Age': [20,41,32,24,45],
                            'Hourly_Rate': [35,35,30,25,32],
                            'Weekly_Working_Hour': [30,40,35,35,42]
                           })
df_employee

   ID   Name     Sex  Age  Hourly_Rate  Weekly_Working_Hour
0   1    Tom    Male   20           35                   30
1   2   John    Male   41           35                   40
2   3  David    Male   32           30                   35
3   4    Eve  Female   24           25                   35
4   5   Anna  Female   45           32                   42

In [54]:
# Adjust the Weekly_Working_Hours by adding 2 hours to each employee by using lamda expression and apply()
df_employee['Weekly_Working_Hour'] = df_employee['Weekly_Working_Hour'].apply(lambda x: x + 2)
df_employee

   ID   Name     Sex  Age  Hourly_Rate  Weekly_Working_Hour
0   1    Tom    Male   20           35                   32
1   2   John    Male   41           35                   42
2   3  David    Male   32           30                   37
3   4    Eve  Female   24           25                   37
4   5   Anna  Female   45           32                   44

In [55]:
# Create a new column 'Seniority' by using lamda expression and apply()
# Employees with age > 40 are considered 'Senior', otherwise 'Junior'
df_employee['Seniority'] = df_employee['Age'].apply(lambda x: 'Senior' if x > 40 else 'Junior')
df_employee

   ID   Name     Sex  Age  Hourly_Rate  Weekly_Working_Hour Seniority
0   1    Tom    Male   20           35                   32    Junior
1   2   John    Male   41           35                   42    Senior
2   3  David    Male   32           30                   37    Junior
3   4    Eve  Female   24           25                   37    Junior
4   5   Anna  Female   45           32                   44    Senior

In [56]:
# Create a new column 'Weekly_Wage' by using lamda expression and apply()
# For employees who are seniors, they will get additional 50 per week. Otherwise nothing.
df_employee['Weekly_Wage'] = (df_employee['Hourly_Rate'] * df_employee['Weekly_Working_Hour']) + \
                              df_employee['Seniority'].apply(lambda x: 50 if x == 'Senior' else 0)
df_employee

,ID,Name,Sex,Age,Hourly_Rate,Weekly_Working_Hour,Seniority,Weekly_Wage
0,1,Tom,Male,20,35,32,Junior,1120
1,2,John,Male,41,35,42,Senior,1520
2,3,David,Male,32,30,37,Junior,1110
3,4,Eve,Female,24,25,37,Junior,925
4,5,Anna,Female,45,32,44,Senior,1458

# map()
Execute a specified function for each item in an iterable. The item is sent to the function as a parameter.

In [57]:
def square(num):
    return num**2

In [58]:
my_num_list = [1,2,3,4,5]

In [59]:
for item in map(square,my_num_list):
    print(item)

1
4
9
16
25

In [60]:
list(map(square,my_num_list))

[1, 4, 9, 16, 25]

In [61]:
# Can also be done without defining square function by using lambda expression
list(map(lambda x: x**2,my_num_list))

[1, 4, 9, 16, 25]

In [62]:
# Create a dataframe
df_employee = pd.DataFrame({'ID':[1,2,3,4,5],
                            'Name': ['Tom','John','David','Eve','Anna'],
                            'Sex': ['Male','Male','Male','Female','Female'],
                            'Age': [20,41,32,24,45],
                            'Hourly_Rate': [35,35,30,25,32],
                            'Weekly_Working_Hour': [30,40,35,35,42]
                           })
df_employee

   ID   Name     Sex  Age  Hourly_Rate  Weekly_Working_Hour
0   1    Tom    Male   20           35                   30
1   2   John    Male   41           35                   40
2   3  David    Male   32           30                   35
3   4    Eve  Female   24           25                   35
4   5   Anna  Female   45           32                   42

In [63]:
# Define a function for seniority check
# Employees with age > 40 are considered 'Senior', otherwise 'Junior'
def seniority_check(age):
    if age > 40:
        seniority = 'Senior'
    else:
        seniority = 'Junior'
        
    return seniority

In [64]:
# Create a new column 'Seniority' by map()
df_employee['Seniority'] = df_employee['Age'].map(seniority_check)
df_employee

   ID   Name     Sex  Age  Hourly_Rate  Weekly_Working_Hour Seniority
0   1    Tom    Male   20           35                   30    Junior
1   2   John    Male   41           35                   40    Senior
2   3  David    Male   32           30                   35    Junior
3   4    Eve  Female   24           25                   35    Junior
4   5   Anna  Female   45           32                   42    Senior

In [65]:
# Create a new column 'Country'
df_employee['Country'] = ['USA','UK','Singapore','France','Brazil']
df_employee

,ID,Name,Sex,Age,Hourly_Rate,Weekly_Working_Hour,Seniority,Country
0,1,Tom,Male,20,35,30,Junior,USA
1,2,John,Male,41,35,40,Senior,UK
2,3,David,Male,32,30,35,Junior,Singapore
3,4,Eve,Female,24,25,35,Junior,France
4,5,Anna,Female,45,32,42,Senior,Brazil

In [66]:
# Create a new column 'Continent' using map()
df_employee['Continent'] = df_employee['Country'].map({'USA': 'North America',
                                                       'UK': 'Europe',
                                                       'Singapore': 'Asia', 
                                                       'France': 'Europe', 
                                                       'Brazil': 'South America'})

In [67]:
df_employee

,ID,Name,Sex,Age,Hourly_Rate,Weekly_Working_Hour,Seniority,Country,Continent
0,1,Tom,Male,20,35,30,Junior,USA,North America
1,2,John,Male,41,35,40,Senior,UK,Europe
2,3,David,Male,32,30,35,Junior,Singapore,Asia
3,4,Eve,Female,24,25,35,Junior,France,Europe
4,5,Anna,Female,45,32,42,Senior,Brazil,South America

# filter()
Return an iterator were the items are filtered through a function to test if the item is accepted or not.

In [68]:
def myFunc(x):
    if x < 18:
        return False
    else:
        return True

In [69]:
ages = [5, 12, 17, 18, 24, 32]

In [70]:
list(filter(myFunc, ages))

[18, 24, 32]

In [71]:
for item in list(filter(myFunc, ages)):
    print(item)

18
24
32

In [72]:
# Or this can be done without defining function myFunc using lambda expression
list(filter(lambda x: False if x < 18 else True, ages))

[18, 24, 32]

In [73]:
for item in list(filter(lambda x: False if x < 18 else True, ages)):
    print(item)

18
24
32

In [74]:
def check_even(num):
    return num%2 == 0

In [75]:
mynums = [1,2,3,4,5,6]

In [76]:
list(filter(check_even,mynums))

[2, 4, 6]

In [77]:
for item in filter(check_even,mynums):
    print(item)

2
4
6

In [78]:
# Or this can be done without defining function check_even using lambda expression
list(filter(lambda x: True if x%2 == 0 else False,mynums))

[2, 4, 6]

In [79]:
for item in filter(lambda x: True if x%2 == 0 else False,mynums):
    print(item)

2
4
6